Catalogs/РасходыПериода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>РасходыПериода</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвращатьВНОБДляНалогаНаПрибыль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафаПриложения1</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НалогНаПрибыль_Приложение1</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>TrId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение5</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафаПриложения5</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НалогНаПрибыль_Приложение5</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение3</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафаПриложения3</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НалогНаПрибыль_Приложение3</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеСтрокиПриложенияОтчетности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ПриложенияКРасчетуНалогаНаПрибыль.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ПриложенияКРасчетуНалогаНаПрибыль</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НеВычетаемыеРасходыВключаемыеНОБ</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтрокаПриложения3</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.НалогНаПрибыль_Приложение1</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеВычетаемыеРасходыВключаемыеНОБОтчетногоПериода</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтрокаПриложения4</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.НалогНаПрибыль_Приложение3</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УменьшениеНОБ</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтрокаПриложения7</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.НалогНаПрибыль_Приложение5</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РасходыПериода</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/РасходыПериода/Forms/ФормаЭлементаУправляемая/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВозвращатьВНОБДляНалогаНаПрибыльПриИзменении(Элемент)
	Установитьвидимость();
КонецПроцедуры

&НаКлиенте
Процедура Приложение3ПриИзменении(Элемент)
	Установитьвидимость();
КонецПроцедуры

&НаКлиенте
Процедура Приложение5ПриИзменении(Элемент)
	Установитьвидимость();
КонецПроцедуры
&НаКлиенте

Процедура Установитьвидимость()
	Элементы.ГрафаПриложения1.Видимость = Объект.ВозвращатьВНОБДляНалогаНаПрибыль;
	Элементы.ГрафаПриложения3.Видимость = Объект.Приложение3;
	Элементы.ГрафаПриложения5.Видимость = Объект.Приложение5;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Установитьвидимость();
	//ОбновитьДанные();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТЗ = РеквизитФормыВЗначение("ТаблицаРегистра");
	ТЗ = РегистрыСведений.ПриложенияКРасчетуНалогаНаПрибыль.СрезПоследних(ТекущаяДата(),новый структура("СтатьяЗатрат",Объект.Ссылка)).Скопировать();
	ЗначениеВРеквизитФормы(ТЗ, "ТаблицаРегистра");	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанные()
	ОписаниеПриложений="";
	Если ТаблицаРегистра.Количество()<> 0 Тогда
		ОписаниеПриложений = ?(ЗначениеЗаполнено( Строка(ТаблицаРегистра[0].СтрокаПриложения3)),"Приложение №3- " + Строка(ТаблицаРегистра[0].СтрокаПриложения3)+ Символы.ПС,"");
		ОписаниеПриложений = ОписаниеПриложений + ?(ЗначениеЗаполнено( Строка(ТаблицаРегистра[0].СтрокаПриложения4)),"Приложение №4- " + Строка(ТаблицаРегистра[0].СтрокаПриложения4)+ Символы.ПС,"");
		ОписаниеПриложений = ОписаниеПриложений + ?(ЗначениеЗаполнено( Строка(ТаблицаРегистра[0].СтрокаПриложения7)),"Приложение №7- " + Строка(ТаблицаРегистра[0].СтрокаПриложения7),"");
		Объект.ОписаниеСтрокиПриложенияОтчетности = ОписаниеПриложений;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПриложенияНОБНаСервере()
	
	ТЗ = РеквизитФормыВЗначение("ТаблицаРегистра");
	ТЗ.Очистить();
	ТЗ = РегистрыСведений.ПриложенияКРасчетуНалогаНаПрибыль.СрезПоследних(ТекущаяДата(),новый структура("СтатьяЗатрат",Объект.Ссылка)).Скопировать();
	ЗначениеВРеквизитФормы(ТЗ, "ТаблицаРегистра");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПриложения(ВыбранноеЗначение,Доппараметры) Экспорт
	ЗаполнитьПриложенияНОБНаСервере();
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПриложенияНОБ(Команда)
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьПриложения",ЭтаФорма);
	ПередаваемыеПараметры = Новый Структура;
	ПередаваемыеПараметры.Вставить("СтатьяЗатрат",Объект.Ссылка);
    ОткрытьФорму("РегистрСведений.ПриложенияКРасчетуНалогаНаПрибыль.Форма.ФормаСпискаУправляемая",ПередаваемыеПараметры,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры
